#!/bin/bash

proverka(){
	if [[ $# -ne 4 ]]; then
        echo "Ошибка: Неправильное количество параметров. Должно быть 4 параметра."
        return 1
    fi

    for i in "$@"; do
        if ! [[ "$i" =~ ^[0-9]+$ ]]; then
            echo "Ошибка: Параметр '$i' не является числом."
            return 1
        fi
    done

    for i in "$@"; do
        if [[ "$i" -lt 1 || "$i" -gt 6 ]]; then
            echo "Ошибка: Параметр '$i' должен быть числом от 1 до 6."
            return 1
        fi
    done

    if [[ "$1" -eq "$2" ]]; then
        echo "Ошибка: Цвет текста названий и цвет фона названий не должны совпадать."
        return 1
    fi

    if [[ "$3" -eq "$4" ]]; then
        echo "Ошибка: Цвет текста значений и цвет фона значений не должны совпадать."
        return 1
    fi
}
