#!/bin/bash

check_parameters() {
    if [ -z "$1" ]; then
        echo "Ошибка: Не указан путь к директории."
        echo "Использование: $0 <путь_к_директории>/"
        exit 1
    fi

    if [[ "$1" != */ ]]; then
        echo "Ошибка: Путь должен заканчиваться знаком '/'."
        echo "Использование: $0 <путь_к_директории>/"
        exit 1
    fi

    if [ ! -d "$1" ]; then
        echo "Ошибка: Директория '$1' не существует."
        exit 1
    fi

    if [ ! -r "$1" ]; then
        echo "Ошибка: Нет прав на чтение директории '$1'."
        exit 1
    fi
}
